tap "alhadis/troff"
tap "d12frosted/emacs-plus"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "jez/formulae"
tap "neovim/neovim"
tap "romkatv/powerlevel10k"
tap "universal-ctags/universal-ctags"
tap "xwmx/taps"
cask "adoptopenjdk8"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]

# Distributed revision control system
brew "git"

## Utils

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# GNU binary tools for native development
brew "binutils"

# Modern replacement for 'ls'
brew "exa"

# Command-line fuzzy finder written in Go
brew "fzf"

# GNU awk utility
brew "gawk"

# Improved top (interactive process viewer)
brew "htop"

# Command-line benchmarking tool
brew "hyperfine"

# Simplified and community-driven man pages
brew "tldr"

# Modern replacement for ps written by Rust
brew "procs"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Password manager
brew "pass"

# Swiss-army knife of markup format conversion
brew "pandoc"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Version control system designed to be a better CVS
brew "subversion"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# File browser
brew "ranger"

## Writing

# Proofreading tool to help writers of technical documentation
# brew "redpen"

# Linter for prose
# brew "proselint", link: false

## Programming

### Python

# Highly performant implementation of Python 2 in Python
brew "pypy"

# Implementation of Python 3 in Python
brew "pypy3"

### Shell

# Next-generation plugin manager for zsh
brew "zplug"

# UNIX shell (command interpreter)
brew "zsh"

# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

# Additional completion definitions for zsh
brew "zsh-completions"

# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"

# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"

# Cross-shell prompt for astronauts
# brew "starship"

### Terminal

# Terminal multiplexer
brew "tmux"

## Org

# Command-line time tracking application
brew "timewarrior"

# Minimal, todo.txt-focused editor
brew "todo-txt"

# Multifunction timer tool
brew "utimer"

# Full-screen terminal interface for Taskwarrior
brew "vit"

# Command-line tool to track (your) time
brew "watson"

# Terminal user interface for taskwarrior
brew "taskwarrior-tui"

# Client-server synchronization for todo lists
brew "taskd"

# Shell wrapper for Taskwarrior commands
brew "tasksh"

### Mail

# Address book with mutt support
brew "abook"

# Text mode MUA using notmuch mail
brew "alot"

# Synchronize a maildir with an IMAP server
brew "isync", restart_service: true

## Unsorted

# Search tool like grep, but optimized for programmers
brew "ack"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: true
# Manipulates BibTeX databases
brew "bib-tool"
# BibTeX bibliography file pretty printer and syntax checker
brew "bibclean"
# Bibliography conversion utilities
brew "bibutils"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# New way to see and navigate directory trees
brew "broot"
# Powerful command-line bookmark manager
brew "buku"
# Vector graphics library with cross-device output support
brew "cairo"
# Arbitrary precision calculator
brew "calc"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Anti-virus software
brew "clamav"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Literate documentation system for C, C++, and Java
brew "cweb"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# GNU diction and style
brew "diction"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# More intuitive version of du in rust
brew "dust"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Useful examples at the command-line
brew "eg-examples"
# Text mode web browser
brew "elinks"
# CLI tool to input and store your ideas without leaving the terminal
brew "eureka"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# X.Org: Font package creation/installation utilities
brew "font-util"
# Command-line outline and bitmap font editor/converter
brew "fontforge", link: false
# Library for manipulating fonts
brew "fonttools", link: false
# Infamous electronic fortune-cookie generator
brew "fortune"
# Free Pascal: multi-architecture Pascal compiler
brew "fpc"
# Language for typesetting graphs
brew "grap"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Library to render SVG files using Cairo
brew "librsvg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Image processing library
brew "vips"
# Note taking and to-do application with synchronisation capabilities
brew "joplin"
# CLI calendar application
brew "khal"
# Console carddav client
brew "khard"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Style and grammar checker
brew "languagetool"
# LastPass command-line interface tool
# brew "lastpass-cli"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Next-gen compiler infrastructure
brew "llvm"
# Package manager for the Lua programming language
brew "luarocks"
# Internet file retriever
brew "wget"
# Manage and switch between versions of Lua, LuaJIT, and Luarocks
brew "luaver"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Metadata anonymization toolkit
brew "mat2"
# Terminal-based visual file manager
brew "midnight-commander"
# Dynamic modification of a user's environment via modulefiles
brew "modules"
# Remote terminal application
brew "mosh"
# MP3 player for Linux and UNIX
brew "mpg123"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Text editor based on the POSIX standard
brew "ne"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Convert OpenDocument files to plain text
brew "odt2txt"
# Synchronizes emails between two repositories
brew "offlineimap"
# Development kit for the Java programming language
brew "openjdk"
# Independent Rust text editor that runs in your terminal
brew "ox"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Library and executable for using citeproc with pandoc
brew "pandoc-citeproc"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# Securely redacting and stripping metadata
brew "pdf-redact-tools"
# Port of pdftk in java
brew "pdftk-java"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# StarDict Console Version
brew "sdcv"
# Source-code syntax highlighter
brew "source-highlight"
# Terminal-based client for Spotify
brew "spotify-tui"
# Shell Users' Revolutionary Front Rage Against the Web
brew "surfraw"
# Open source continuous file synchronization application
brew "syncthing", restart_service: true
# System performance benchmark tool
brew "sysbench"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Ncurses-based presentation tool
brew "tpp"
# CLI tool that moves files or folder to the trash
brew "trash"
# Extract, view, and test RAR archives
brew "unrar"
# URL extractor/launcher
brew "urlview"
# Syntax-aware linter for prose
brew "vale"
# Synchronize calendars and contacts
brew "vdirsyncer"
# Ncurses based file manager with vi like keybindings
brew "vifm"
# Add progress bars to command-line applications
brew "vramsteg"
# Pager/text based browser
brew "w3m"
# Display word differences between text files
brew "wdiff"
# Web Outside of Browsers
brew "weboob"
# Homebrew, but with Docker images
brew "whalebrew"
# Unicode-aware word processor that runs in a terminal
brew "wordgrinder"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# New cd command that helps you navigate faster by learning your habits
brew "z.lua"
# GTK+ dialog boxes for the command-line
brew "zenity"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Modern, featureful implementation of the Unix man page system
brew "alhadis/troff/man-db"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-spacemacs-icon"]
# Convert Pandoc Markdown-style footnotes into sidenotes
brew "jez/formulae/pandoc-sidenote"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "xwmx/taps/nb"

# CASKS

cask "amethyst"
cask "anki"
cask "avast-security"
cask "basictex"
cask "birdfont"
cask "bitwarden"
cask "calibre"
cask "cheatsheet"
cask "chromium"
cask "cisdem-pdf-converter-ocr"
cask "clean-me"
cask "deepl"
cask "discord"
cask "djview"
cask "docker"
cask "dropbox"
cask "electric-sheep"
cask "firefox-nightly"
cask "geektool"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iina"
cask "inkscape"
cask "iterm2"
cask "jabref"
cask "joplin"
cask "julia"
cask "keybase"
cask "kindle"
cask "kitty"
cask "libreoffice"
cask "macterm"
cask "malwarebytes"
cask "manuscripts"
cask "menubar-countdown"
cask "notable"
cask "notational-velocity"
cask "obs"
cask "obsidian"
cask "pdfsam-basic"
cask "polar-bookshelf"
cask "protonmail-bridge"
cask "protonvpn"
cask "qbittorrent"
cask "quicksilver"
cask "qutebrowser"
cask "rectangle"
cask "riot"
cask "sage"
cask "sigil"
cask "signal"
cask "skim"
cask "skyfonts"
cask "skype"
cask "spotify"
cask "standard-notes"
cask "stats"
cask "steam"
cask "superproductivity"
cask "syntax-highlight"
cask "taskwarrior-pomodoro"
cask "telegram-desktop"
cask "tex-live-utility"
cask "thorium"
cask "thunderbird"
cask "tor-browser"
cask "virtualbox"
cask "vlc"
cask "zettlr"
cask "zoomus"
cask "zotero"

# mas

mas "Amphetamine", id: 937984704
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Todoist", id: 585829637
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835

# FONTS

cask "font-academicons"
cask "font-alegreya"
cask "font-alegreya-sans"
cask "font-alegreya-sans-sc"
cask "font-alegreya-sc"
cask "font-andika"
cask "font-asap"
cask "font-asap-condensed"
cask "font-asap-vf-beta"
cask "font-atkinson-hyperlegible"
cask "font-averia-serif-libre"
cask "font-awesome-terminal-fonts"
cask "font-bebas-neue"
cask "font-belleza"
cask "font-bitstream-vera"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-bitter"
cask "font-blokk-neue"
cask "font-bree-serif"
cask "font-caladea"
cask "font-cardo"
cask "font-carter-one"
cask "font-charis-sil"
cask "font-charter"
cask "font-cochineal"
cask "font-comic-neue"
cask "font-comic-sans-ms"
cask "font-commissioner"
cask "font-cormorant"
cask "font-cousine"
cask "font-crimson-pro"
cask "font-crimson-text"
cask "font-darker-grotesque"
cask "font-dm-serif-display"
cask "font-dm-serif-text"
cask "font-doulos-sil"
cask "font-eb-garamond"
cask "font-et-book"
cask "font-ezra-sil"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-firago"
cask "font-fontawesome"
cask "font-gentium-basic"
cask "font-gentium-book-basic"
cask "font-gentium-plus"
cask "font-gfs-didot"
cask "font-gfs-neohellenic"
cask "font-hack-nerd-font"
cask "font-hasklig"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "font-inconsolata"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g"
cask "font-inconsolata-g-for-powerline"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-inria"
cask "font-inria-sans"
cask "font-inria-serif"
cask "font-inter"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-slab"
cask "font-jetbrains-mono"
cask "font-jost"
cask "font-juliamono"
cask "font-junicode"
cask "font-latin-modern"
cask "font-latin-modern-math"
cask "font-lato"
cask "font-liberation"
cask "font-liberation-mono-for-powerline"
cask "font-liberation-nerd-font"
cask "font-libertinus"
cask "font-libre-caslon-display"
cask "font-libre-caslon-text"
cask "font-libre-franklin"
cask "font-linux-biolinum"
cask "font-linux-libertine"
cask "font-literata"
cask "font-lobster"
cask "font-lobster-two"
cask "font-lora"
cask "font-marcellus"
cask "font-marcellus-sc"
cask "font-menlo-for-powerline"
cask "font-metropolis"
cask "font-monoid"
cask "font-monoid-nerd-font"
cask "font-monoisome"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-nimbus-sans-l"
cask "font-noto-emoji"
cask "font-noto-mono"
cask "font-noto-sans"
cask "font-noto-sans-cuneiform"
cask "font-noto-sans-phoenician"
cask "font-noto-sans-runic"
cask "font-noto-serif"
cask "font-noto-serif-display"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-orbitron"
cask "font-overpass"
cask "font-overpass-mono"
cask "font-overpass-nerd-font"
cask "font-playfair-display"
cask "font-playfair-display-sc"
cask "font-pt-sans"
cask "font-pt-sans-caption"
cask "font-pt-sans-narrow"
cask "font-pt-serif"
cask "font-pt-serif-caption"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-slab"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "font-space-grotesk"
cask "font-space-mono"
cask "font-spectral"
cask "font-stix"
cask "font-syne"
cask "font-tex-gyre-adventor"
cask "font-tex-gyre-bonum"
cask "font-tex-gyre-bonum-math"
cask "font-tex-gyre-chorus"
cask "font-tex-gyre-cursor"
cask "font-tex-gyre-heros"
cask "font-tex-gyre-pagella"
cask "font-tex-gyre-pagella-math"
cask "font-tex-gyre-schola"
cask "font-tex-gyre-schola-math"
cask "font-tex-gyre-termes"
cask "font-tex-gyre-termes-math"
cask "font-tinos"
cask "font-tinos-nerd-font"
cask "font-ubuntu"
cask "font-ubuntu-condensed"
cask "font-ubuntu-mono"
cask "font-victor-mono"
cask "font-vollkorn"
cask "font-vollkorn-sc"
cask "font-work-sans"
cask "font-xits"
cask "font-ysabeau"
cask "font-zilla-slab"
cask "font-zilla-slab-highlight"
cask "fontexplorer-x-pro"
cask "fontforge"
